## How to update values

In [9]:
import pandas as pd

In [10]:
data = {
    "Name": ["Ram", "Shyam", "Ghansyam", "Kam", "Aaram", "Sharam", "Gharam"],
    "Age": [12, 13, 14, 15, 16, 17, 18],
    "City": ["Delhi", "Mumbai", "Kolkata", "Chennai", "Bangalore", "Hyderabad", "Pune"],
    "Salary": [1000, 2000, 3000, 4000, 5000, 6000, 7000],
    "Performance Score": [56, 85, 95, 62, 75, 88, 90],
}

In [11]:
df = pd.DataFrame(data)
print(df)

       Name  Age       City  Salary  Performance Score
0       Ram   12      Delhi    1000                 56
1     Shyam   13     Mumbai    2000                 85
2  Ghansyam   14    Kolkata    3000                 95
3       Kam   15    Chennai    4000                 62
4     Aaram   16  Bangalore    5000                 75
5    Sharam   17  Hyderabad    6000                 88
6    Gharam   18       Pune    7000                 90

### Update any value
-   df.loc[row_index, 'Column_Name'] = value

In [12]:
df.loc[1, 'Salary'] = 2500
print(df)

       Name  Age       City  Salary  Performance Score
0       Ram   12      Delhi    1000                 56
1     Shyam   13     Mumbai    2500                 85
2  Ghansyam   14    Kolkata    3000                 95
3       Kam   15    Chennai    4000                 62
4     Aaram   16  Bangalore    5000                 75
5    Sharam   17  Hyderabad    6000                 88
6    Gharam   18       Pune    7000                 90

In [13]:
df['Salary'] = df['Salary'] * 1.1
print(df)

       Name  Age       City  Salary  Performance Score
0       Ram   12      Delhi  1100.0                 56
1     Shyam   13     Mumbai  2750.0                 85
2  Ghansyam   14    Kolkata  3300.0                 95
3       Kam   15    Chennai  4400.0                 62
4     Aaram   16  Bangalore  5500.0                 75
5    Sharam   17  Hyderabad  6600.0                 88
6    Gharam   18       Pune  7700.0                 90

## How to remove any column if no longer needed

-   df.drop('column_name', axis=1, inplace=True)
-   df.drop(['column_name_1', 'column_name_2'], axis=1, inplace=True)

-   inplace = True means the changes will be made in the same dataframe
-   inplace = False means the changes will be made in a new dataframe

-   axis = 1 means column
-   axis = 0 means row

-   You can pass one column name or a list of column names to the drop() function.

In [14]:
df.drop('Performance Score', axis=1, inplace=True)
print(df)

       Name  Age       City  Salary
0       Ram   12      Delhi  1100.0
1     Shyam   13     Mumbai  2750.0
2  Ghansyam   14    Kolkata  3300.0
3       Kam   15    Chennai  4400.0
4     Aaram   16  Bangalore  5500.0
5    Sharam   17  Hyderabad  6600.0
6    Gharam   18       Pune  7700.0

In [15]:
df.drop([0, 1], axis=0, inplace=True)
print(df)

       Name  Age       City  Salary
2  Ghansyam   14    Kolkata  3300.0
3       Kam   15    Chennai  4400.0
4     Aaram   16  Bangalore  5500.0
5    Sharam   17  Hyderabad  6600.0
6    Gharam   18       Pune  7700.0